Notes/Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Notes</title>
<!-- 2014-09-21 Sun 00:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Abraham Xiao" />
</head>
<body>
<div id="content">
<h1 class="title">Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. What is Git?</a>
<ul>
<li><a href="#sec-1-1">1.1. Version Control System (VCS)</a></li>
<li><a href="#sec-1-2">1.2. Git is born</a></li>
<li><a href="#sec-1-3">1.3. Distributed version control</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Pros</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Who should use Git</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Git configuration</a></li>
<li><a href="#sec-3">3. Getting Started</a>
<ul>
<li><a href="#sec-3-1">3.1. Initialize a repository</a></li>
<li><a href="#sec-3-2">3.2. Writing commit messages</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. Best practices</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3. Viewing the commit log</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Git concepts and architectures</a>
<ul>
<li><a href="#sec-4-1">4.1. Three-tree architecture</a></li>
<li><a href="#sec-4-2">4.2. Git workflow</a></li>
<li><a href="#sec-4-3">4.3. Using hash values</a></li>
<li><a href="#sec-4-4">4.4. Working with the HEAD pointer</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Making changes to files</a>
<ul>
<li><a href="#sec-5-1">5.1. Adding files</a></li>
<li><a href="#sec-5-2">5.2. Editing files</a></li>
<li><a href="#sec-5-3">5.3. Viewing changes with diff</a></li>
<li><a href="#sec-5-4">5.4. Viewing only staged changed</a></li>
<li><a href="#sec-5-5">5.5. Deleting files</a></li>
<li><a href="#sec-5-6">5.6. Moving and renaming files</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Using Git in a Real Project</a>
<ul>
<li><a href="#sec-6-1">6.1. Introduce the Explore California web site</a></li>
<li><a href="#sec-6-2">6.2. Initializing Git</a></li>
<li><a href="#sec-6-3">6.3. Editing the support phone number</a></li>
<li><a href="#sec-6-4">6.4. Editing the backpack file name and links</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Undoing Changes</a>
<ul>
<li><a href="#sec-7-1">7.1. Undoing working directory changes</a></li>
<li><a href="#sec-7-2">7.2. Unstaging files</a></li>
<li><a href="#sec-7-3">7.3. Amending commits</a></li>
<li><a href="#sec-7-4">7.4. Retrieving old commits</a></li>
<li><a href="#sec-7-5">7.5. Reverting a commit</a></li>
<li><a href="#sec-7-6">7.6. Using reset to undo commits</a></li>
<li><a href="#sec-7-7">7.7. Demonstrating a soft reset</a></li>
<li><a href="#sec-7-8">7.8. Demonstrating a mixed reset</a></li>
<li><a href="#sec-7-9">7.9. Demonstrating a hard reset</a></li>
<li><a href="#sec-7-10">7.10. Removing untracked files</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Ignoring files</a>
<ul>
<li><a href="#sec-8-1">8.1. Using .gitignore files</a>
<ul>
<li><a href="#sec-8-1-1">8.1.1. Example</a></li>
</ul>
</li>
<li><a href="#sec-8-2">8.2. Understanding what to ignore</a></li>
<li><a href="#sec-8-3">8.3. Ignoring files globally</a></li>
<li><a href="#sec-8-4">8.4. Ignoring tracked files</a></li>
<li><a href="#sec-8-5">8.5. Tracking empty directory</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Navigating the Commit Tree</a>
<ul>
<li><a href="#sec-9-1">9.1. Referencing commits</a></li>
<li><a href="#sec-9-2">9.2. Exploring tree listings</a></li>
<li><a href="#sec-9-3">9.3. Getting more from the commit log</a></li>
<li><a href="#sec-9-4">9.4. Viewing Commits</a></li>
<li><a href="#sec-9-5">9.5. Comparing Commits</a></li>
</ul>
</li>
<li><a href="#sec-10">10. Branching</a>
<ul>
<li><a href="#sec-10-1">10.1. Branching overview</a></li>
<li><a href="#sec-10-2">10.2. Viewing and creating branch</a></li>
<li><a href="#sec-10-3">10.3. Switching branches</a></li>
<li><a href="#sec-10-4">10.4. Create and Switch Branches</a></li>
<li><a href="#sec-10-5">10.5. Switching branches with uncommitted changes</a></li>
<li><a href="#sec-10-6">10.6. Compare branches</a></li>
<li><a href="#sec-10-7">10.7. Renaming branches</a></li>
<li><a href="#sec-10-8">10.8. Deleting branches</a></li>
<li><a href="#sec-10-9">10.9. Configuring the command prompt to show the branch</a></li>
</ul>
</li>
<li><a href="#sec-11">11. Merging branches</a>
<ul>
<li><a href="#sec-11-1">11.1. Merging code</a></li>
<li><a href="#sec-11-2">11.2. Using fast-forward merge v.s. true merge</a></li>
<li><a href="#sec-11-3">11.3. Merging conflicts</a></li>
<li><a href="#sec-11-4">11.4. Resolving merge conflicts</a>
<ul>
<li><a href="#sec-11-4-1">11.4.1. Abort, resolve manually or use a merge tool</a></li>
</ul>
</li>
<li><a href="#sec-11-5">11.5. Exploring strategies to reduce merge conflicts</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What is Git?</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Version Control System (VCS)</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Source code control system
</li>
<li>Revision control system
</li>
<li>Concurrent Versions System
</li>
<li>Apache Subversion
</li>
<li>BitKeeper SCM (distributed version control, community version)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Git is born</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Distributed
</li>
<li>Open source and free software
</li>
<li>Compatible with Unix-like systems
</li>
<li>Github launched 2008, 2011 2M repositories, over 1M users
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Distributed version control</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>different users maintain their own
</li>
<li>changes are stores as "change sets"
</li>
<li>No single master repo, just many working copies
</li>
</ul>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Pros</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>no need to communicate with a central server
</li>
<li>encourage participation and "forking"
</li>
<li>"loose groups" of open source developers
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Who should use Git</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>anyone wanting to track edits
</li>
<li>anyone needing to share changes with collaborators
</li>
<li>anyone not afraid of command-line tools
</li>
<li>Programmers and Developers
</li>
<li>Not as useful for tracking <b>non-text</b> files
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Git configuration</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>System, Users, Project
</li>
<li></li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Getting Started</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Initialize a repository</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>git init
</li>
<li><code>echo "this is my first file" &gt;&gt; first_file.txt</code>
</li>
<li>See the *.sh file for detailed codes
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Writing commit messages</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>short single-line summary
</li>
<li>followed by a blank line and a more complete description
</li>
<li>Keep each line to less than 72 characters
</li>
<li>Write in present tense
</li>
<li>Bullet points
</li>
</ul>
</div>

<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Best practices</h4>
<div class="outline-text-4" id="text-3-2-1">
<ul class="org-ul">
<li>"Add missing &gt; in project section of HTML" NOT Fix Typo
</li>
<li>"Change user authentication to use Blowfish" NOT Update login code
</li>
<li><b>Provide a good labour of what is inside the commit</b>
</li>
<li>MEMO: Write in present tense, note past tense.
</li>
<li>It's not about you, it's about what the COMMIT does.
</li>
<li>Use Emacs or Vim as your editor when you write your commit
messages. "She can look at it, and see what it is." WHEN SHE
DOES <b>git merge</b>.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Viewing the commit log</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>git log; git log &#x2013;help; git log -n 1; git log -n 2; git log -n 0
</li>
<li></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Git concepts and architectures</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Three-tree architecture</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Two-tree: repository, working
<ul class="org-ul">
<li>commit, checkout
</li>
</ul>
</li>
<li>Three-tree architecture
<ul class="org-ul">
<li>repository, staging index, working
</li>
<li>git add file.txt, git commit file.txt
</li>
<li>We can make changes to 10 files but you can JUST commit 5
of 10. The rest files are still saved and waiting for your
another commit.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Git workflow</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Git works with a set of files that makes of "change sets"
</li>
<li>working &#x2013;&gt; staging index &#x2013;&gt; repository (<code>git commit</code>)
</li>
<li><code>git add</code> &#x2013;&gt; <code>git commit</code>
</li>
<li><code>git log</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Using hash values</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Git generates a checksum for each change set
</li>
<li>data integrity is fundamental
</li>
<li>Git uses SHA-1 hash algorithm to create checksums
</li>
<li>Referring to commits
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Working with the HEAD pointer</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>point to the "tip" of current branch in repository
</li>
<li>last state of repository
</li>
<li>AKA: point to <b>parent of next commit</b>
</li>
<li>Especially important in "branch" concepts.
<ul class="org-ul">
<li><b>Checkout &#x2013;&gt; tip of the currently checked-out branch</b>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Making changes to files</h2>
