Notes/Notes.org
** Demonstrating a hard reset
   - Rewind the HEAD pointer, and throw out everything after that
     (that means after the commit you reset)
   - "I do not want everything that happened after that. I JUST WISH
     TO GO BACK!!!"
   - git reset --hard $SOME_OTHER_HASH_VALUE
   - git log
   - git status
   - *But those old commits are still there!* You can still use the
     ~git reset --hard $HASH_VALUE~ go back.
   - Do some modifications.
   - git commit -am "Moved sunglasses higher in list of suggested
     outdoor items"
   - *Just be careful when you use them!* They do allow you to
     overwrite data

** Removing untracked files
   - Create some junk files
   - ~git clean~
   - git clean -n; git clean -f (throw away the untracked files, they
     will be permanently deleted)

* Ignoring files

** Using .gitignore files
   - What if it's a temporary file or a log file? Just tell git to
     ignore the file ALL-TOGETHER.
   - create (or auto-create project/.gitignore)
   - very basic regular expressions
   - negate expressions with "!"
   - ignore all files in a directory with a trailing slash, like
     "assets/videos/"
   - And all these go back to the good old Command-Line shit. (Aka,
     shellcript and bala bala)
*** Example
    - nano .gitignore
      - tempfile.txt, and hit "RETURN"
    - git status
    - .DS_Stores *.zip *.gz log/*.log log/*.login.[0-9] assets/videos/
      assets/photoshop/ !assets/videos/tour_*.mp4 (sample .gitignore
      content)
    - git add .gitignore
    - git commit -m "Add .gitignore file"

** Understanding what to ignore
   - Compiled source code
   - Packages and compressed files
   - Logs and databases
   - Operating system generated files
   - user-uploaded assets (images, PDFs, videos)
   - https://htlp.github.com/articles/ignoring-files
   - https://github,com/github/gitignore

** Ignoring files globally
   - ignore files in all repositories
   - settings not tracked in repository
   - user-specific instead of repository-specific
   - Add/Edit the global ignore files, and then use the following
     command to configure
   - git config --global core.excludesfile ~/.gitignore_global (the
     filename differs as you want)

** Ignoring tracked files
   - git add tempfile2.txt
   - git commit -m "Add tempfile2.txt to working directory"
   - "So I am going to use the command line :) "
   - "What if we want to leave it in our repository?"
   - git rm --cached tempfile2.txt (SEARCH THE FUCKING WEB, AND READ
     THE FUCKING MANUAL)
   - More changes made to tempfile2.txt will *not* be tracked. Because
     it has been removed from the staging index, aka, the cache.

** Tracking empty directory
   - cd $YOUR_WORKING_FOLDER && mkdir $SOME_NEW_EMPTY_FOLDER
   - cd $SOME_NEW_EMPTY_FOLDER && *touch .gitkeep*
   - How-todo: Just add some empty files in the directory which you
     want git to track. As simple as that.
   - No matter how small, it has to be a file, so the directory is NOT
     empty. 

* Navigating the Commit Tree

** Referencing commits
   - Tree-ish
     - full SHA-1 hash
     - short SHA-1 hash, at least 4 characters, unambiguous (8-10
       characters)
   - HEAD pointer
   - branch reference, tag reference (It seems that TAG is extremely
     popular)
   - parent commit
     - HEAD^, HEAD~1, master^, HEAD~
   - grandparent commit
     - HEAD^^, HEAD~2
   - great-grandparent commit
     - HEAD^^^, HEAD~3 (tide notation is more, well, compact)

** Exploring tree listings
   - pwd; ls -al
   - git ls-tree
   - git ls-tree master assets/
   - git ls-tree master~1 assets/ (guess what a tree is? A tree is a
     DIRECTORY! This clearly explains the tree-ish notation.)

** Getting more from the commit log
   - git log --oneline
   - git log --oneline -3
   - git log --oneline -5 (how many logs to be shown)
   - git log --since="2012-06-20"
   - git log --until="2012-06-20"
   - git log --since="2 weeks ago" --until="3 days ago" (2.weeks
     3.days)
   - git log --author="Kevin" (nice to filter out when collaborate
     with other people)
   - git log --grep="temp"
   - *You can see now why good commit messages is very helpful!* It
     can help you search.
   - git log $HASH_VALUE..$SOME_OTHER_HASH_VALUE index.html (or some
     specific file)
   - git log -p (p for patch to show the difference) It is recommended
     to combine some of those commands.
   - git log --stat --summary (idea of quantities changes)
   - *Pretty Cool* git log --graph ; git log --oneline --graph --all
     -- decorate
   - DIG TO THE LOG FILES, READ AND PRACTICE MORE, PLEASE!

** Viewing Commits
   - git log --oneline
   - git show $HASH_VALUE (of your specific commit)
   - git show --format=oneline HEAD~2
   - git show --format=oneline HEAD~3
   - git ls-tree master
   - git show $HASH_VALUE (of your tree/blobs/etc)
   - use *git show --help* to find more of your concern

# Life is a bitch, fuck it or leave it, choose one. I choose to fuck
# it and graduate as normal in the United Arab Emirates.

** Comparing Commits
   - Compare the "directory" of that commit
   - use *git status* and for remote management *git pull* often is a
     good habit
   - git diff --staged; git diff --cached
   - "The diff tool is very flexible."
   - git log --oneline; git diff $HASH_VALUE (of tree-ish stuff)
   - "We can compare where we are now and what's different in the
     past"
   - As in Xnix system, you can use the good old "git diff" to compare
     *two* or more things. By the way, READ THE FUCKING MANUAL.
   - git diff --stat --summary $SOME_OTHER_HASH_VALUE..HEAD
     (--ignore-space-change --ignore-all-space -b (ignore space
     changes) -w (ignore all spaces))

* Branching
One of the most powerful features in Git

