Notes/Notes.html

<div id="outline-container-sec-7-9" class="outline-3">
<h3 id="sec-7-9"><span class="section-number-3">7.9</span> Demonstrating a hard reset</h3>
<div class="outline-text-3" id="text-7-9">
<ul class="org-ul">
<li>Rewind the HEAD pointer, and throw out everything after that
(that means after the commit you reset)
</li>
<li>"I do not want everything that happened after that. I JUST WISH
TO GO BACK!!!"
</li>
<li>git reset &#x2013;hard $SOME<sub>OTHER</sub><sub>HASH</sub><sub>VALUE</sub>
</li>
<li>git log
</li>
<li>git status
</li>
<li><b>But those old commits are still there!</b> You can still use the
<code>git reset --hard $HASH_VALUE</code> go back.
</li>
<li>Do some modifications.
</li>
<li>git commit -am "Moved sunglasses higher in list of suggested
outdoor items"
</li>
<li><b>Just be careful when you use them!</b> They do allow you to
overwrite data
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7-10" class="outline-3">
<h3 id="sec-7-10"><span class="section-number-3">7.10</span> Removing untracked files</h3>
<div class="outline-text-3" id="text-7-10">
<ul class="org-ul">
<li>Create some junk files
</li>
<li><code>git clean</code>
</li>
<li>git clean -n; git clean -f (throw away the untracked files, they
will be permanently deleted)
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Ignoring files</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Using .gitignore files</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>What if it's a temporary file or a log file? Just tell git to
ignore the file ALL-TOGETHER.
</li>
<li>create (or auto-create project/.gitignore)
</li>
<li>very basic regular expressions
</li>
<li>negate expressions with "!"
</li>
<li>ignore all files in a directory with a trailing slash, like
"assets/videos/"
</li>
<li>And all these go back to the good old Command-Line shit. (Aka,
shellcript and bala bala)
</li>
</ul>
</div>
<div id="outline-container-sec-8-1-1" class="outline-4">
<h4 id="sec-8-1-1"><span class="section-number-4">8.1.1</span> Example</h4>
<div class="outline-text-4" id="text-8-1-1">
<ul class="org-ul">
<li>nano .gitignore
<ul class="org-ul">
<li>tempfile.txt, and hit "RETURN"
</li>
</ul>
</li>
<li>git status
</li>
<li>.DS<sub>Stores</sub> <b>.zip *.gz log/</b>.log log/*.login.[0-9] assets/videos/
assets/photoshop/ !assets/videos/tour<sub>*</sub>.mp4 (sample .gitignore
content)
</li>
<li>git add .gitignore
</li>
<li>git commit -m "Add .gitignore file"
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Understanding what to ignore</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>Compiled source code
</li>
<li>Packages and compressed files
</li>
<li>Logs and databases
</li>
<li>Operating system generated files
</li>
<li>user-uploaded assets (images, PDFs, videos)
</li>
<li><a href="https://htlp.github.com/articles/ignoring-files">https://htlp.github.com/articles/ignoring-files</a>
</li>
<li><a href="https://github,com/github/gitignore">https://github,com/github/gitignore</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> Ignoring files globally</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>ignore files in all repositories
</li>
<li>settings not tracked in repository
</li>
<li>user-specific instead of repository-specific
</li>
<li>Add/Edit the global ignore files, and then use the following
command to configure
</li>
<li>git config &#x2013;global core.excludesfile ~/.gitignore<sub>global</sub> (the
filename differs as you want)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> Ignoring tracked files</h3>
<div class="outline-text-3" id="text-8-4">
<ul class="org-ul">
<li>git add tempfile2.txt
</li>
<li>git commit -m "Add tempfile2.txt to working directory"
</li>
<li>"So I am going to use the command line :) "
</li>
<li>"What if we want to leave it in our repository?"
</li>
<li>git rm &#x2013;cached tempfile2.txt (SEARCH THE FUCKING WEB, AND READ
THE FUCKING MANUAL)
</li>
<li>More changes made to tempfile2.txt will <b>not</b> be tracked. Because
it has been removed from the staging index, aka, the cache.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> Tracking empty directory</h3>
<div class="outline-text-3" id="text-8-5">
<ul class="org-ul">
<li>cd $YOUR<sub>WORKING</sub><sub>FOLDER</sub> &amp;&amp; mkdir $SOME<sub>NEW</sub><sub>EMPTY</sub><sub>FOLDER</sub>
</li>
<li>cd $SOME<sub>NEW</sub><sub>EMPTY</sub><sub>FOLDER</sub> &amp;&amp; <b>touch .gitkeep</b>
</li>
<li>How-todo: Just add some empty files in the directory which you
want git to track. As simple as that.
</li>
<li>No matter how small, it has to be a file, so the directory is NOT
empty. 
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Navigating the Commit Tree</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Referencing commits</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>Tree-ish
<ul class="org-ul">
<li>full SHA-1 hash
</li>
<li>short SHA-1 hash, at least 4 characters, unambiguous (8-10
characters)
</li>
</ul>
</li>
<li>HEAD pointer
</li>
<li>branch reference, tag reference (It seems that TAG is extremely
popular)
</li>
<li>parent commit
<ul class="org-ul">
<li>HEAD^, HEAD~1, master^, HEAD~
</li>
</ul>
</li>
<li>grandparent commit
<ul class="org-ul">
<li>HEAD^^, HEAD~2
</li>
</ul>
</li>
<li>great-grandparent commit
<ul class="org-ul">
<li>HEAD^^^, HEAD~3 (tide notation is more, well, compact)
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> Exploring tree listings</h3>
<div class="outline-text-3" id="text-9-2">
<ul class="org-ul">
<li>pwd; ls -al
</li>
<li>git ls-tree
</li>
<li>git ls-tree master assets/
</li>
<li>git ls-tree master~1 assets/ (guess what a tree is? A tree is a
DIRECTORY! This clearly explains the tree-ish notation.)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> Getting more from the commit log</h3>
<div class="outline-text-3" id="text-9-3">
<ul class="org-ul">
<li>git log &#x2013;oneline
</li>
<li>git log &#x2013;oneline -3
</li>
<li>git log &#x2013;oneline -5 (how many logs to be shown)
</li>
<li>git log &#x2013;since="2012-06-20"
</li>
<li>git log &#x2013;until="2012-06-20"
</li>
<li>git log &#x2013;since="2 weeks ago" &#x2013;until="3 days ago" (2.weeks
3.days)
</li>
<li>git log &#x2013;author="Kevin" (nice to filter out when collaborate
with other people)
</li>
<li>git log &#x2013;grep="temp"
</li>
<li><b>You can see now why good commit messages is very helpful!</b> It
can help you search.
</li>
<li>git log $HASH<sub>VALUE</sub>..$SOME<sub>OTHER</sub><sub>HASH</sub><sub>VALUE</sub> index.html (or some
specific file)
</li>
<li>git log -p (p for patch to show the difference) It is recommended
to combine some of those commands.
</li>
<li>git log &#x2013;stat &#x2013;summary (idea of quantities changes)
</li>
<li><b>Pretty Cool</b> git log &#x2013;graph ; git log &#x2013;oneline &#x2013;graph &#x2013;all
&#x2013; decorate
</li>
<li>DIG TO THE LOG FILES, READ AND PRACTICE MORE, PLEASE!
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> Viewing Commits</h3>
<div class="outline-text-3" id="text-9-4">
<ul class="org-ul">
<li>git log &#x2013;oneline
</li>
<li>git show $HASH<sub>VALUE</sub> (of your specific commit)
</li>
<li>git show &#x2013;format=oneline HEAD~2
</li>
<li>git show &#x2013;format=oneline HEAD~3
</li>
<li>git ls-tree master
</li>
<li>git show $HASH<sub>VALUE</sub> (of your tree/blobs/etc)
</li>
<li>use <b>git show &#x2013;help</b> to find more of your concern
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9-5" class="outline-3">
<h3 id="sec-9-5"><span class="section-number-3">9.5</span> Comparing Commits</h3>
<div class="outline-text-3" id="text-9-5">
<ul class="org-ul">
<li>Compare the "directory" of that commit
</li>
<li>use <b>git status</b> and for remote management <b>git pull</b> often is a
good habit
</li>
<li>git diff &#x2013;staged; git diff &#x2013;cached
</li>
<li>"The diff tool is very flexible."
</li>
<li>git log &#x2013;oneline; git diff $HASH<sub>VALUE</sub> (of tree-ish stuff)
</li>
<li>"We can compare where we are now and what's different in the
past"
</li>
<li>As in Xnix system, you can use the good old "git diff" to compare
<b>two</b> or more things. By the way, READ THE FUCKING MANUAL.
</li>
<li>git diff &#x2013;stat &#x2013;summary $SOME<sub>OTHER</sub><sub>HASH</sub><sub>VALUE</sub>..HEAD
(&#x2013;ignore-space-change &#x2013;ignore-all-space -b (ignore space
changes) -w (ignore all spaces))
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Branching</h2>
<div class="outline-text-2" id="text-10">
<p>
One of the most powerful features in Git
</p>
</div>
