Notes/Notes.org
** Branching overview
   - branches are cheap
     - try new ideas
     - isolate features or sections of work. When all is finished, we
       can merge it into "master" branch.      
   - One working directory.
   - fast context switching.
     - master...some other features...merge (will create a new commit)
   - We could have mini branches and merge more often.

** Viewing and creating branch
   - git branch; cat .git/HEAD; ls -al .git/refs/heads
   - cat .git/refs/head/master
   - *Create a new branch* git branch $BRANCH_NAME (stay away from
     punctuation); ls -al .git/refs/heads
   - cat .git/refs/heads/$BRANCH_NAME
   - cat .git/HEAD

** Switching branches
   - "We do that by checking out the branch"
   - git checkout $BRANCH_NAME; cat .git/HEAD;
   - git status; git commit -am "Modified title of bala bala"; git log
     --oneline
   - git checkout master; git log --oneline (Branching when needed,
     but not when you "feel like". Use your own judgment)
   - It's that easy to swap out files and folders when you have
     multiple branches, just check it out.

** Create and Switch Branches
   - pwd; git log --oneline; git show HEAD
   - git checkout -b $BRANCH_NAME (checkout and switching at the same
     time) *Give your branch useful and meaningful name*
   - git branch; git log --oneline;
   - Re: git checkout -- <file> ("--" just keeps you in this working
     branch, so you do not mess it up)
   - git add $SOME_FILES; git commit -m "Your commit message"; git log
     --oneline
   - git checkout master; git log --graph --oneline --decorate --all
     (You really understand how the switching works and you really
     should feel comfortable with it. Because this is normal when you
     begin to, well ,work)

** Switching branches with uncommitted changes
   - checkout (go and get the latest branch, so your working directory
     must be clean to do that)
   - git status; make some changes to your files; git status;
   - git checkout master (Commit your changes or stash them *before*
     *you can switch branches*)
   - Possible options:
     - ~checkout -- <file>~ to discard changes
     - commit; git commit -am "Swap out - for : in index.html title"
     - stash
   - You cannot have anything that may *lose* data when switch branch!
     (Empty file or those that do not violate this rule)

** Compare branches
   - git diff $NAME_OF_BRANCHES; git diff master..new_features
   - git diff master..some_other_branch
   - git diff --color-words branch1..branch2
   - "*tree-ish*" concept in git
   - git branch --merged (checkout some different branches and use
     this command to see what will happen)
   -

** Renaming branches
   - pwd; git branch
   - git diff master..branch1;
   - Rename branch: git branch -m branch1 renamed_branch1; (git
     considers rename as mv, the same way as Xnix does)
   - Give your branch *meaningful names* that help you distinguish
     what the commits are all about!


# Life is a bitch, fuck it or leave it, choose one.
** Deleting branches
   - git branch branch_to_delete; (born to be deleted)
   - git branch -d branch_to_delete
   - git branch (check whether it is still there)
   - git branch branch_to_delete;
   - git checkout branch_to_delete; git branch -d branch_to_delete;
     (this operation would failed because you CANNOT delete the branch
     which you are currently on.)
   - "The branch 'branch_to_delete' is not fully merged! If you are
     sure you want to delete it, run 'git branch -D branch_to_delete'"
   - *Read the fucking Manual* man! Be a real professional, work hard
     and fight for a bright future. (Commented by Abraham)

** Configuring the command prompt to show the branch
   - Not necessary, but most Git developers choose to do this.
   - There are some configurations in your shell config file. Do it at
     your own wish.

* Merging branches

** Merging code
   - Pull request and merge operation.
   - First, check out the "receiver"
   - git checkout master; git merge $SOME_BRANCH
   - git diff master..$SOME_BRANCH (see if there are still some
     differences) 
   - git branch --merged
   - You always want to run "git merge" with a clean working directory

** Using fast-forward merge v.s. true merge
   - Fast-forward: move the commit along the timeline, then move the
     HEAD pointer.
   - git merge --no-ff branch; (You do not want to merge quietly, you
     want to log something)
   - Non-fast-forward merge: when the HEAD pointer is not in the
     current branch (practice more to feel)
   - git merge $SOME_OTHER_BRANCH
   - Merge has different strategies for merging.


** Merging conflicts
   - Git cannot decide which one to use or how to merge them
     together.
   - Example:
     - <span>Git is great.</span>
     - <strong>Git is great.</strong>
     - <em>Git is great.</em> (Yet another branch, so HOW TO MERGE)
   - Make some changes to an existing file. (So to confuse the stupid
     Version Control.)
   - Automatic merge failed! *Fix conflicts* and then commit the
     result.
   - It's up to you to pick (or choose) which one to useful, aka to
     merge when there are "REAL" conflicts.

** Resolving merge conflicts
   - git merge --abort (You have to do something, or the conflict(s)
     are still there)
   - *Resolve those conflicts manually* Use your own judgment to
     resolve the conflict. Some are to be kept, others to be
     discarded.
   - It's more "advanced" to use those merge tools.

*** Abort, resolve manually or use a merge tool

