Notes/Notes.html

<div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> Branching overview</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li>branches are cheap
<ul class="org-ul">
<li>try new ideas
</li>
<li>isolate features or sections of work. When all is finished, we
can merge it into "master" branch.      
</li>
</ul>
</li>
<li>One working directory.
</li>
<li>fast context switching.
<ul class="org-ul">
<li>master&#x2026;some other features&#x2026;merge (will create a new commit)
</li>
</ul>
</li>
<li>We could have mini branches and merge more often.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> Viewing and creating branch</h3>
<div class="outline-text-3" id="text-10-2">
<ul class="org-ul">
<li>git branch; cat .git/HEAD; ls -al .git/refs/heads
</li>
<li>cat .git/refs/head/master
</li>
<li><b>Create a new branch</b> git branch $BRANCH<sub>NAME</sub> (stay away from
punctuation); ls -al .git/refs/heads
</li>
<li>cat .git/refs/heads/$BRANCH<sub>NAME</sub>
</li>
<li>cat .git/HEAD
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> Switching branches</h3>
<div class="outline-text-3" id="text-10-3">
<ul class="org-ul">
<li>"We do that by checking out the branch"
</li>
<li>git checkout $BRANCH<sub>NAME</sub>; cat .git/HEAD;
</li>
<li>git status; git commit -am "Modified title of bala bala"; git log
&#x2013;oneline
</li>
<li>git checkout master; git log &#x2013;oneline (Branching when needed,
but not when you "feel like". Use your own judgment)
</li>
<li>It's that easy to swap out files and folders when you have
multiple branches, just check it out.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-10-4" class="outline-3">
<h3 id="sec-10-4"><span class="section-number-3">10.4</span> Create and Switch Branches</h3>
<div class="outline-text-3" id="text-10-4">
<ul class="org-ul">
<li>pwd; git log &#x2013;oneline; git show HEAD
</li>
<li>git checkout -b $BRANCH<sub>NAME</sub> (checkout and switching at the same
time) <b>Give your branch useful and meaningful name</b>
</li>
<li>git branch; git log &#x2013;oneline;
</li>
<li>Re: git checkout &#x2013; &lt;file&gt; ("&#x2013;" just keeps you in this working
branch, so you do not mess it up)
</li>
<li>git add $SOME<sub>FILES</sub>; git commit -m "Your commit message"; git log
&#x2013;oneline
</li>
<li>git checkout master; git log &#x2013;graph &#x2013;oneline &#x2013;decorate &#x2013;all
(You really understand how the switching works and you really
should feel comfortable with it. Because this is normal when you
begin to, well ,work)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-10-5" class="outline-3">
<h3 id="sec-10-5"><span class="section-number-3">10.5</span> Switching branches with uncommitted changes</h3>
<div class="outline-text-3" id="text-10-5">
<ul class="org-ul">
<li>checkout (go and get the latest branch, so your working directory
must be clean to do that)
</li>
<li>git status; make some changes to your files; git status;
</li>
<li>git checkout master (Commit your changes or stash them <b>before</b>
     <b>you can switch branches</b>)
</li>
<li>Possible options:
<ul class="org-ul">
<li><code>checkout -- &lt;file&gt;</code> to discard changes
</li>
<li>commit; git commit -am "Swap out - for : in index.html title"
</li>
<li>stash
</li>
</ul>
</li>
<li>You cannot have anything that may <b>lose</b> data when switch branch!
(Empty file or those that do not violate this rule)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-10-6" class="outline-3">
<h3 id="sec-10-6"><span class="section-number-3">10.6</span> Compare branches</h3>
<div class="outline-text-3" id="text-10-6">
<ul class="org-ul">
<li>git diff $NAME<sub>OF</sub><sub>BRANCHES</sub>; git diff master..new<sub>features</sub>
</li>
<li>git diff master..some<sub>other</sub><sub>branch</sub>
</li>
<li>git diff &#x2013;color-words branch1..branch2
</li>
<li>"<b>tree-ish</b>" concept in git
</li>
<li>git branch &#x2013;merged (checkout some different branches and use
this command to see what will happen)
</li>
<li></li>
</ul>
</div>
</div>

<div id="outline-container-sec-10-7" class="outline-3">
<h3 id="sec-10-7"><span class="section-number-3">10.7</span> Renaming branches</h3>
<div class="outline-text-3" id="text-10-7">
<ul class="org-ul">
<li>pwd; git branch
</li>
<li>git diff master..branch1;
</li>
<li>Rename branch: git branch -m branch1 renamed<sub>branch1</sub>; (git
considers rename as mv, the same way as Xnix does)
</li>
<li>Give your branch <b>meaningful names</b> that help you distinguish
what the commits are all about!
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-10-8" class="outline-3">
<h3 id="sec-10-8"><span class="section-number-3">10.8</span> Deleting branches</h3>
<div class="outline-text-3" id="text-10-8">
<ul class="org-ul">
<li>git branch branch<sub>to</sub><sub>delete</sub>; (born to be deleted)
</li>
<li>git branch -d branch<sub>to</sub><sub>delete</sub>
</li>
<li>git branch (check whether it is still there)
</li>
<li>git branch branch<sub>to</sub><sub>delete</sub>;
</li>
<li>git checkout branch<sub>to</sub><sub>delete</sub>; git branch -d branch<sub>to</sub><sub>delete</sub>;
(this operation would failed because you CANNOT delete the branch
which you are currently on.)
</li>
<li>"The branch 'branch<sub>to</sub><sub>delete'</sub> is not fully merged! If you are
sure you want to delete it, run 'git branch -D branch<sub>to</sub><sub>delete'</sub>"
</li>
<li><b>Read the fucking Manual</b> man! Be a real professional, work hard
and fight for a bright future. (Commented by Abraham)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-10-9" class="outline-3">
<h3 id="sec-10-9"><span class="section-number-3">10.9</span> Configuring the command prompt to show the branch</h3>
<div class="outline-text-3" id="text-10-9">
<ul class="org-ul">
<li>Not necessary, but most Git developers choose to do this.
</li>
<li>There are some configurations in your shell config file. Do it at
your own wish.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Merging branches</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> Merging code</h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li>Pull request and merge operation.
</li>
<li>First, check out the "receiver"
</li>
<li>git checkout master; git merge $SOME<sub>BRANCH</sub>
</li>
<li>git diff master..$SOME<sub>BRANCH</sub> (see if there are still some
differences) 
</li>
<li>git branch &#x2013;merged
</li>
<li>You always want to run "git merge" with a clean working directory
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> Using fast-forward merge v.s. true merge</h3>
<div class="outline-text-3" id="text-11-2">
<ul class="org-ul">
<li>Fast-forward: move the commit along the timeline, then move the
HEAD pointer.
</li>
<li>git merge &#x2013;no-ff branch; (You do not want to merge quietly, you
want to log something)
</li>
<li>Non-fast-forward merge: when the HEAD pointer is not in the
current branch (practice more to feel)
</li>
<li>git merge $SOME<sub>OTHER</sub><sub>BRANCH</sub>
</li>
<li>Merge has different strategies for merging.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-11-3" class="outline-3">
<h3 id="sec-11-3"><span class="section-number-3">11.3</span> Merging conflicts</h3>
<div class="outline-text-3" id="text-11-3">
<ul class="org-ul">
<li>Git cannot decide which one to use or how to merge them
together.
</li>
<li>Example:
<ul class="org-ul">
<li>&lt;span&gt;Git is great.&lt;/span&gt;
</li>
<li>&lt;strong&gt;Git is great.&lt;/strong&gt;
</li>
<li>&lt;em&gt;Git is great.&lt;/em&gt; (Yet another branch, so HOW TO MERGE)
</li>
</ul>
</li>
<li>Make some changes to an existing file. (So to confuse the stupid
Version Control.)
</li>
<li>Automatic merge failed! <b>Fix conflicts</b> and then commit the
result.
</li>
<li>It's up to you to pick (or choose) which one to useful, aka to
merge when there are "REAL" conflicts.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-11-4" class="outline-3">
<h3 id="sec-11-4"><span class="section-number-3">11.4</span> Resolving merge conflicts</h3>
<div class="outline-text-3" id="text-11-4">
<ul class="org-ul">
<li>git merge &#x2013;abort (You have to do something, or the conflict(s)
are still there)
</li>
<li><b>Resolve those conflicts manually</b> Use your own judgment to
resolve the conflict. Some are to be kept, others to be
discarded.
</li>
<li>It's more "advanced" to use those merge tools.
</li>
</ul>
</div>

<div id="outline-container-sec-11-4-1" class="outline-4">
<h4 id="sec-11-4-1"><span class="section-number-4">11.4.1</span> Abort, resolve manually or use a merge tool</h4>
</div>
</div>
